OdIfc.Utils.getAllRepresentationContexts(OdIfcFile!System.Runtime.CompilerServices.IsConst*)
\details
Collectd OdDAIObjectIds of all IfcGeometricRepresentationContext instances in a model of IFC file.
\param pIfcFile [in] Pointer to OdIfcFile that keeps IFC model.
\returnt Returns an array of OdDAIObjectId of all geometric representation contexts of a model.

OdIfc.Utils.getDefaultRepresentationContextsSelection(OdIfcFile!System.Runtime.CompilerServices.IsConst*,System.Boolean)
\details
Tries to collect OdDAIObjectIds of all IfcGeometricRepresentationContext instances needed to get
geometrical representation of a model of IFC file.
\param pIfcFile [in] Pointer to OdIfcFile that keeps IFC model.
\param onlyBody [in] If true, selects only sub contexts that have identifier "Body".
\returnt Returns an array of OdDAIObjectId of geometric representation context to get representations from,
or empty array if nothing was selected by default.

OdIfc.Utils.assignGlobalId(OdIfc.OdIfcEntity*)
\details
Assigns generated globalId to the attribute 'GlobalId' of entity derived from IfcRoot.
\param pInst [in] Pointer to the IFC entity instance.
\returns Returns true is GlobalId assigned successfully, otherwise returns false.